package day1129;

public class Ex01_yesterday {

	public static void main(String[] args) {
		
		// 단축키
		
		// 자료형 변수
		
		// 변수 : 데이터를 담기 위한 메모리 공간
		// 자료형 : 변수에 담을 값에 대해서 알맞게 지정하는 키워드
		/*
		 * 정수형 - byte /  short / int / long
		 *    	- 소수점이 없다
		 *      - 각각의 차이는 표현할 수 있는  숫자의 범위
		 *      - 2^8  /  2^16  / 2^32 / 2^64
		 *      - 1byte/ 2byte  / 4byte/ 8byte
		 *      - -2^n-1 ~ 2^n-1
		 *      
		 * 실수형 - float / double
		 * 		- 소수점이 있다.
		 * 		- .6자리 / .15자리
		 * 
		 * 문자형 - char
		 * 		- 한글자 , ' '
		 * 
		 * 논리형 - boolean
		 *      - true / false / 참과 거짓
		 *      
		 * 문자열형 - String
		 * 		 - 한글자이상, " "
		 * 
		 * 변수 선언
		 * 자료형 변수이름;
		 * 
		 * 변수 대입
		 * 변수이름 = 원하는값;
		 * 
		 * 원하는 값 : 항상 변수의 자료형과 동일한 값을 작성해야 한다.
		 * 
		 * 선언과 대입을 동시에
		 * 
		 * int i = 값;
		 * 
		 * ------------데이터 입력---------------------
		 * 
		 *	System.out.println(); >> 내용 출력 후 줄바꿈 있음
		 *	System.out.print();   >> 내용 출력 후 줄바꿈 없음
		 * 
		 * 문자일 경우 " " 감싸야 합니다.
		 * 숫자, 변수이름 작성 가능
		 * 
		 * 위 경우를 합치고 싶을 겨우 + 라는 문자로 연결합니다.
		 * 문자열 + 숫자 >> 연결
		 * 문자열 + 문자열 >> 연결
		 * 숫자 + 숫자 >> 계산
		 * 
		 * 변수 + 숫자 >> 변수에 따라 다르다. String 이면 연결 / int면 계산
		 * 변수1 + 변수2 >> 마찬가지
		 * 
		 * 
		 * 
		 * 
		 */
		
		

	}

}








