package day1130;

public class Ex01_yesterday {

	public static void main(String[] args) {
		
		// 형변환
		// byte > short,char > int > long > float > double
		// 선언한 자료형이 있지만 다른 자료형을 가진 값을 넣기 위한 자료형의 변환 작업
		// 담을 수 있는 범위가 작은 자료형부터 큰 자료형으로 옮길때는 자동 (묵시적, 자동 형변환)
		// 반대상황은 강제로 명시해야한다. (명시적, 강제 형변환)
		
		// 연산자
		// + - * / % : 산술연산자
		// ++변수, 변수--, --변수, 변수-- : +1, -1 과정을 해당 코드가 실행하기 전이냐 실헹 후에 하느냐 구분
		// == != > >= < <= : 수학에서는 = 같다/ 프로그래밍에서는 == 같다, =은 대입(초기화)
		
		// = : 대입연산자, 변수의 초기화 작업
		// 산술연산자와 대입연산자를 같이 사용하면
		// += -= *= /= %= : 
		// a+=1 : 1. 왼쪽값과 오른쪽값을 산술 연산자에 의해 작업
		//		  2. 작업한 결과를 왼쪽값(변수)	에 대입
		
		// if 라는 제어문, 분기문, 조건문
		
		// 프로그래밍은 main 메소드의 상단에서 하단으로 실행이됩니다.
		// 제어문들을 통해서 특정한 조건에서 실행 또는 반복할때 
		// 프로그램의 흐름을 상단에서 하단으로 실행하는 것 뿐만 아니라 분기를 만들거나 반복을 통해 제어
		
		// 조건문 if
		// 만약에 특정한 조건이 참이라면 실행하는 제어문
		// 만약 일어나는 시간이 7시면 / 더 잔다
		// 만약 일어나는 시간이 8시면 / 학원을 갈 준비
		// 만약 일어나는 시간이 9시면 / 아프다고 연락
		
//		if( 조건 ) // 참과 거짓과 같은 논리형 결과: boolean{
			// {}코드블럭, if문의 조건이 참일 경우에만 실행하는 코드 블럭
			// 조건이 참일 경우에만 실행 (변수선언, 출력문, 계산식, 제어문 등...)
//		} else { // if(조건){...} 뒤에 작성되어야 하는 문장
			// if문의 조건이 거짓일 경우에만 실행
			// 거짓일 경우에 실행할 것이 없으면 생략 가능
		}
	
		
		
			
		
		
		
	}





















